{

  "info": {
    "name": {
      "first": "Nathanael",
      "last": "See"
    },
    "description": "Sophomore at UC San Diego, B.S Computer Science 2020",
    "location": "San Diego, CA",
    "email": "nathanaelsee@yahoo.com",
    "github": "nathanaelsee",
    "linkedin": "nathanaelsee",
    "resume": "https://docs.google.com/document/d/10r_CPO4m64JiRzIXrexidT37pvxxwoBVNsi_xR6ltiE/export?format=pdf"
  },

  "projects": [
    {
      "title": "Personal Website",
      "subtitle": "UCSD CAT 125",
      "github": "nathanaelsee/nathanaelsee.github.io",
      "description": [
        "Wrote a personal portfolio site in React and Semantic UI, hosted on Github Pages.",
        "Wrote custom components in React for dynamic filtering of projects by tags. (you're seeing this right now!)"        
      ],
      "tags": ["React", "Semantic UI", "Node.js"]
    },
    {
      "title": "Halecoin",
      "subtitle": "HackUCI 2018",
      "github": "quasimik/halecoin",
      "description": [
        "Won 'Best Overall Hack' & 'Best Social Hack' at HackUCI 2018 for a new Ethereum-based cryptocoin mined by doing exercise.", 
        "Implemented an asynchronous pushup detection algorithm in Node.js, parsing real-time data from OpenPose, a deep learning library which extracts motion capture data from real-time webcam input.",
        "Implemented exponential running average on detection algorithm output for callbacks to Firebase backend.",
        "Worked on React front-end for demo of proof-of-concept during hackathon judging stage."        
      ],
      "tags": ["React", "Node.js", "Firebase", "Ethereum", "OpenPose", "Hackathon"]
    },
    {
      "title": "Pex",
      "subtitle": "SBHacks 2018",
      "github": "quasimik/pex",
      "description": [
        "Collected data and trained a linear classifier in Tensorflow to recognize exercise forms, obtaining ~95% accuracy.",
        "Wrote an interface in Python between the classifier and open-source real-time monocular pose detection library OpenPose, towards providing real-time form checking for first-time gym goers without fitness coaches."
      ],
      "tags": ["Python", "Flask", "Tensorflow", "Machine Learning", "OpenPose", "Hackathon"]
    },
    {
      "title": "BusBoss",
      "subtitle": "LAHacks 2017",
      "github": "quasimik/BusBoss",
      "description": [
        "Created & demoed a statistical model for estimating turnout of hackathon participants, for better estimation of bus capacity needs to facilitate improved provision of transportation."
      ],
      "tags": ["Node.js", "Python", "AWS", "Hackathon"]
    },
    {
      "title": "The People Walk",
      "subtitle": "SBHacks 2017",
      "github": "nathanaelsee/thepeoplewalk",
      "description": [
        "Created & demoed a web app to crowdsource real-time geolocated data of ongoing protests worldwide, using NodeJS and Esri’s ArcGIS API, hosted on AWS Elastic Beanstalk."
      ],
      "tags": ["Node.js", "Express", "ArcGIS", "AWS", "Hackathon"]
    },
    {
      "title": "Rote",
      "subtitle": "SDHacks 2016",
      "github": "nathanaelsee/Rote",
      "description": ["Created & demoed a gamified flashcard review app on Android as part of a team of 3 hackathon first-timers, leading the team throughout development from ideation to completion."],
      "tags": ["Android", "Hackathon"]
    },
    {
      "title": "DoCloud",
      "subtitle": "RI-IDA INVENT 2012",
      "github": "ashiswin/DoCloud",
      "description": [
        "Created an Android app as part of a team of 4, for cloud-based task sharing/delegation for project management, in the inaugural batch of a startup incubator in high school.", 
        "Pitched the app to a panel of government and industry experts, winning a $1000 award."
      ],
      "tags": ["Android", "Startup"]
    }
  ]

}
